# Вывести треугольник #4 с шириной N с помощью цикла while



N = int(input('Введите ширину треугольника '))
for N in range(0, 6, 1):
        print(("*" * N).rjust(5))