# Вывести треугольник #3 с шириной N с помощью цикла while


N = int(input('Введите ширину треугольника '))
for N in range(5,0,-1):
    print(('*' * N).rjust(5))